app/Controllers/EvaluacionController.php

SELECT *
FROM `evaluaciones`
ORDER BY `fecha_evaluacion` DESC
---
    public function index()
    {
        $personaId = $this->request->getGet('persona_id');

        if ($personaId) {
            $evaluaciones = $this->evaluacionModel->getEvaluacionesPorPersona($personaId);
            $persona = $this->personaModel->find($personaId);
            $titulo = 'Evaluaciones de: ' . ($persona ? $persona['primer_nombre'] . ' ' . $persona['primer_apellido'] : 'Desconocido');
        } else {
            $evaluaciones = $this->evaluacionModel->orderBy('fecha_evaluacion', 'DESC')->findAll();