app/Controllers/HomeController.php

SELECT COUNT(*) AS `numrows` FROM `evaluaciones`
SELECT *
FROM `seguimientos`
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function dashboard()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        // Estadísticas
        $statsPersonas = $this->personaModel->getEstadisticas();

        $totalEvaluaciones = $this->evaluacionModel->countAll();
        $totalSeguimientos = $this->seguimientoModel->countAll();

        $seguimientosPendientes = $this->seguimientoModel->where('estado', 'PENDIENTE')->countAllResults();
        $seguimientosProximos = count($this->seguimientoModel->getSeguimientosProximos());

        $data = [
            'title'        => 'Dashboard',
            'stats'        => [
                'personas_total'      => $statsPersonas['total'],
                'personas_activas'    => $statsPersonas['activos'],
                'evaluaciones'       => $totalEvaluaciones,
                'seguimientos'       => $totalSeguimientos,
                'pendientes'         => $seguimientosPendientes,
                'proximos'           => $seguimientosProximos,
            ],
            'seguimientos_recientes' => $this->seguimientoModel
                ->orderBy('created_at', 'DESC')
                ->limit(5)
                ->findAll(),
        ];