app/Controllers/PersonaController.php

    public function index()
    {
        $busqueda = $this->request->getGet('q');
        $rol = session()->get('rol');
        $departamentoId = session()->get('departamento_id');

        // Si es ADMIN, ve todas las personas. Si es DIRECTOR, solo ve las de su departamento
        if ($rol === 'ADMIN' || $rol === 'EVALUADOR') {
            if ($busqueda) {
                $personas = $this->personaModel
                    ->groupStart()
                    ->like('primer_nombre', $busqueda)
                    ->orLike('primer_apellido', $busqueda)
                    ->orLike('cedula', $busqueda)
                    ->orLike('correo_electronico', $busqueda)
                    ->groupEnd()
                    ->where('estado_registro', 'ACTIVO')
                    ->orderBy('primer_apellido', 'ASC')
                    ->paginate(15);
            } else {
                $personas = $this->personaModel
                    ->where('estado_registro', 'ACTIVO')
                    ->orderBy('primer_apellido', 'ASC')
                    ->paginate(15);
---
SELECT *
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'
ORDER BY `primer_apellido` ASC
 LIMIT 15
SELECT COUNT(*) AS `numrows`
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'

    public function show($id = null)
    {
        $persona = $this->personaModel->find($id);
---
SELECT *
FROM `personas`
WHERE `personas`.`id` = '1'

    public function edit($id = null)
    {
        $persona = $this->personaModel->find($id);
---
SELECT *
FROM `personas`
WHERE `personas`.`id` = '1'