app/Controllers/ReporteController.php

    public function index()
    {
        $data = [
            'title' => 'Reportes',
            'departamentos' => $this->departamentoModel->findAll(),
---
SELECT *
FROM `departamentos`

    public function personas($formato = 'html')
    {
        $departamentoId = $this->request->getGet('departamento');
        $rol = session()->get('rol');
        $departamentoSession = session()->get('departamento_id');

        // Filtrar por departamento según rol
        if ($rol === 'ADMIN' || $rol === 'EVALUADOR') {
            if ($departamentoId) {
                $personas = $this->personaModel->where('departamento_id', $departamentoId)
                    ->where('estado_registro', 'ACTIVO')
                    ->findAll();
                $departamento = $this->departamentoModel->find($departamentoId);
                $filtros['departamento'] = $departamento['nombre'] ?? 'Todos';
            } else {
                $personas = $this->personaModel->where('estado_registro', 'ACTIVO')->findAll();
---
SELECT *
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'

            return $this->exportPdfPersonas($personas, $filtros);
        }

        $data = [
            'title' => 'Reporte de Personas',
            'personas' => $personas,
            'departamentos' => $this->departamentoModel->findAll(),
            'filtros' => $filtros,
        ];
---
SELECT *
FROM `departamentos`

    public function estadisticas()
    {
        $departamentoId = $this->request->getGet('departamento');
        $rol = session()->get('rol');
        $departamentoSession = session()->get('departamento_id');

        // Obtener personas según rol
        if ($rol === 'ADMIN' || $rol === 'EVALUADOR') {
            if ($departamentoId) {
                $personas = $this->personaModel->where('departamento_id', $departamentoId)
                    ->where('estado_registro', 'ACTIVO')
                    ->findAll();
                $departamento = $this->departamentoModel->find($departamentoId);
                $filtros['departamento'] = $departamento['nombre'] ?? 'Todos';
            } else {
                $personas = $this->personaModel->where('estado_registro', 'ACTIVO')->findAll();
---
SELECT *
FROM `personas`
WHERE `departamento_id` = '3'
AND `estado_registro` = 'ACTIVO'
SELECT *
FROM `departamentos`
WHERE `departamentos`.`id` = '3'
SELECT *
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'

        $data = [
            'title' => 'Estadísticas del Sistema',
            'personas' => $personas,
            'departamentos' => $this->departamentoModel->findAll(),
---
SELECT *
FROM `departamentos`