app/Controllers/SeguimientoController.php

SELECT *
FROM `seguimientos`
ORDER BY `fecha_seguimiento` DESC
---
    public function index()
    {
        $personaId = $this->request->getGet('persona_id');
        $estado = $this->request->getGet('estado');

        if ($personaId) {
            $seguimientos = $this->seguimientoModel->getSeguimientosPorPersona($personaId);
            $persona = $this->personaModel->find($personaId);
            $titulo = 'Seguimientos de: ' . ($persona ? $persona['primer_nombre'] . ' ' . $persona['primer_apellido'] : 'Desconocido');
        } elseif ($estado) {
            $seguimientos = $this->seguimientoModel->getSeguimientosPorEstado($estado);
            $titulo = 'Seguimientos - ' . ucfirst($estado);
            $persona = null;
        } else {
            $seguimientos = $this->seguimientoModel->orderBy('fecha_seguimiento', 'DESC')->findAll();