app/Models/DepartamentoModel.php

SELECT *
FROM `departamentos`
WHERE `estado` = 'ACTIVO'
---
    public function getDepartamentosActivos()
    {
        return $this->where('estado', 'ACTIVO')->findAll();