app/Models/PersonaModel.php

    public function getPersonasActivas()
    {
        return $this->where('estado_registro', 'ACTIVO')->findAll();
---
SELECT *
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'

    public function getEstadisticas()
    {
        $total = $this->countAll();
        $activos = $this->where('estado_registro', 'ACTIVO')->countAllResults();
---
SELECT COUNT(*) AS `numrows` FROM `personas`
SELECT COUNT(*) AS `numrows`
FROM `personas`
WHERE `estado_registro` = 'ACTIVO'