app/Models/SeguimientoModel.php

    public function getSeguimientosPorPersona($personaId)
    {
        return $this->where('persona_id', $personaId)
                    ->orderBy('fecha_seguimiento', 'DESC')
                    ->findAll();
---
SELECT *
FROM `seguimientos`
WHERE `persona_id` = '1'
ORDER BY `fecha_seguimiento` DESC

    public function getSeguimientosPorEstado($estado)
    {
        return $this->where('estado', $estado)
                    ->orderBy('fecha_seguimiento', 'DESC')
                    ->findAll();
---
SELECT *
FROM `seguimientos`
WHERE `estado` = 'COMPLETADO'
ORDER BY `fecha_seguimiento` DESC

    public function getSeguimientosPendientes()
    {
        return $this->where('estado', 'PENDIENTE')
                    ->orWhere('estado', 'EN_PROCESO')
                    ->orderBy('proxima_fecha', 'ASC')
                    ->findAll();
---
SELECT *
FROM `seguimientos`
WHERE `estado` = 'PENDIENTE'
OR `estado` = 'EN_PROCESO'
ORDER BY `proxima_fecha` ASC

    public function getSeguimientosProximos()
    {
        $fecha = date('Y-m-d', strtotime('+7 days'));
        return $this->where('proxima_fecha <=', $fecha)
                    ->where('estado', 'PENDIENTE')
                    ->orderBy('proxima_fecha', 'ASC')
                    ->findAll();
---
SELECT *
FROM `seguimientos`
WHERE `proxima_fecha` <= '2026-03-17'
AND `estado` = 'PENDIENTE'
ORDER BY `proxima_fecha` ASC