app/Models/UsuarioModel.php

SELECT *
FROM `usuarios`
WHERE `username` = 'admin'
OR `email` = 'admin'
 LIMIT 1
UPDATE `usuarios` SET `ultimo_login` = '2026-03-10 14:22:15', `updated_at` = '2026-03-10 14:22:15'
WHERE `usuarios`.`id` IN ('1')
---
    public function verifyCredentials($username, $password)
    {
        $usuario = $this->where('username', $username)
                       ->orWhere('email', $username)
                       ->first();

        if ($usuario && password_verify($password, $usuario['password'])) {
            // Actualizar último login
            $this->update($usuario['id'], ['ultimo_login' => date('Y-m-d H:i:s')]);